import"../chunks/CWj6FrbW.js";import"../chunks/Bse2ZF8v.js";import{P as n,Q as b}from"../chunks/B27TzA2y.js";var e=n(`<article class="svelte-i7fo5p"><h1 class="svelte-i7fo5p">Индивидуальная и&nbsp;проектная карма</h1> <p class="svelte-i7fo5p">Каждый участник зарабатывает <b>индивидуальную карму</b>.
        Индивидуальная карма каждого участника вносит вклад в&nbsp;общую проектную карму. <b>Проектная карма</b>&nbsp;&mdash; среднее арифметическое значений индивидуальной кармы всех его участников.
        Кармический приз будет выдаваться в&nbsp;зависимости от&nbsp;количества проектной кармы.</p> <p class="svelte-i7fo5p">Можно получить положительные баллы индивидуальной кармы за&nbsp;хорошие дела: вопросы на&nbsp;лекциях и&nbsp;защитах,
        помощь
        товарищам, выполнение дополнительных заданий и&nbsp;другое в&nbsp;том&nbsp;же духе. За&nbsp;проступки,
        несоблюдение дедлайнов и
        другие нехорошие дела можно получить отрицательные баллы индивидуальной кармы.</p> <h1 class="svelte-i7fo5p">Размещение заданий</h1> <p class="svelte-i7fo5p">Проектную карму можно использовать для того, чтобы размещать на&nbsp;<a href="tasks">доске объявлений</a> задания для участников других проектов.
        Размещение задания стоит не&nbsp;менее 1&nbsp;балла проектной кармы.
        Выполнение задания участниками приводит к&nbsp;получению кармы.
        Задания могут быть многоразовыми, но&nbsp;за&nbsp;одно задание можно выдать не&nbsp;больше кармы,
        чем было потрачено на&nbsp;его размещение.</p> <h1 class="svelte-i7fo5p">Мультипликаторы кармы</h1> <p class="svelte-i7fo5p">Для проектов предусмотрены мультипликаторы кармы. Если у&nbsp;проекта есть мультипликатор, получаемые баллы
        индивидуальной кармы его участниками будут умножаться на&nbsp;соответствующее значение.</p> <p class="svelte-i7fo5p">Мультипликаторы бывают как положительные, так и&nbsp;отрицательные.</p> <p class="svelte-i7fo5p">Если к&nbsp;концу спринта индивидуальная карма каждого участника проекта положительна, то&nbsp;проект получает
        +0.2&nbsp;к
        текущему мультипликатору для получаемых положительных баллов кармы. Таким образом, после первого спринта
        мультипликатор может составлять 1.2, а&nbsp;после второго спринта&nbsp;&mdash; 1.4. Если участник проекта
        получает
        отрицательную
        карму за&nbsp;проступок, то&nbsp;текущий положительный мультипликатор проекта сгорает.</p> <p class="svelte-i7fo5p">Если в&nbsp;проекте есть хотя&nbsp;бы один участник с&nbsp;отрицательной кармой, вся получаемая отрицательная
        индивидуальная
        карма умножаются на&nbsp;2. Если в&nbsp;проекте есть хотя&nbsp;бы два участника с&nbsp;отрицательной кармой, то&nbsp;вся
        получаемая
        отрицательная индивидуальная карма умножается на&nbsp;3. Это худший возможный отрицательный мультипликатор.</p></article>`);function o(s){var p=e();b(s,p)}export{o as component};
